Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ། བདེན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པའི་ཡེ་ཤེས་སོ།
en: It is the wisdom that understands the truth exactly as it is.

source: འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་ཁོང་དུ་ཆུད་པའོ།
en: It is the realization of both mundane and supramundane qualities.

source: །དེ་ལ་མི་ཤེས་པ་དང་བྲལ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being without ignorance?

source: ཆོས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་ལ་སྒྲོ་འདོགས་པ་དང་བྲལ་བའོ།
en: It is not imposing embellishments on phenomena as they truly are.

source: །དེ་ལ་སེམས་ཀྱི་འཇུག་པ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of the processes of the mind?

source: སྐྱེ་བ་དང་འཇིག་པ་མེད་པ་ཤེས་པའོ།
en: It is the knowledge of the absence of creation and destruction.

source: །དེ་ལ་ཟས་སྒྲུབ་པ་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཤེས་རབ་རྣོ་བའོ།
en: “What is the knowledge of accomplishment and definite accomplishment? It is sharp wisdom.

source: །དེ་ལ་སྒྲ་བརྗོད་པ་ཤེས་པ་གང་ཞེ་ན།
en: “What is the knowledge of all language?

source: འདི་ལྟ་སྟེ། ཆོས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་བསྟན་པའོ།
en: It is correctly teaching the Dharma.

source: །དེ་ལ་རྣམ་པར་གཞག་པ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་འཇུག་པ་ཤེས་པའོ།
en: “What is the knowledge of presentation? It is the knowledge of correct engagement.

source: །དེ་ལ་དོན་རྣམ་པར་གཏན་ལ་དབབ་པ་གང་ཞེ་ན།
en: “What is the knowledge of attaining certainty in meaning?

source: འདི་ལྟ་སྟེ། འདུ་བྱེད་ཀྱི་ཕུང་པོ་ཆད་པའོ།
en: It is cutting through the skandha of mental activities.

source: །དེ་ལ་གནོད་པ་རྣམ་པར་སྤོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is abandoning that which is harmful?

source: སྲིད་པ་ལས་ཡང་དག་པར་འདའ་བ་དང་། གཞན་དག་ཀྱང་སྲིད་པ་ལས་ཡང་དག་པར་འདའ་བ་ལ་འཛུད་པའོ།
en: It is transcending existence and causing others to transcend existence.

source: །དེ་ལ་སྐྱེས་བུ་དམ་པ་ལ་སྟེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is relying upon excellent beings?

source: སངས་རྒྱས་དང་མི་འབྲལ་བའོ།
en: It is not being apart from a buddha.

source: །དེ་ལ་སྐྱེས་བུ་དམ་པ་དང་འགྲོགས་པ་གང་ཞེ་ན།
en: “What is being together with excellent beings?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་། ཉན་ཐོས་ལ་སྟེན་པའོ།
en: It is attending upon buddhas, bodhisattvas, pratyekabuddhas, and śrāvakas.

source: །དེ་ལ་སྐྱེས་བུ་དམ་པ་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་གང་ཞེ་ན།
en: “What is avoiding bad beings?

source: འདི་ལྟ་སྟེ། དམིགས་པ་ཅན་དང་། ལེ་ལོ་ཅན་རྣམས་རྣམ་པར་སྤོང་བའོ།
en: It is avoiding those who are fixated on perceptions and those who are lazy.

source: །དེ་ལ་བསམ་གཏན་མི་འདོར་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདོད་པའི་ཚེར་མ་རྣམ་པར་སྤོང་བ་དང་། བསམ་གཏན་མི་གཏོང་ཞིང་དགའ་བ་མི་འདོར་བའོ།
en: “What is delighting in dhyāna? It is avoiding the thorns of desire, not forsaking dhyāna, and not abandoning joy.

source: །དེ་ལ་བསམ་གཏན་ལ་མ་ཆགས་པ་གང་ཞེ་ན།
en: “What is not clinging to dhyāna?

source: འདི་ལྟ་སྟེ། ཁམས་གསུམ་ལས་ཡང་དག་པར་འདའ་བར་མོས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་མོས་པ་དང་། གོང་དུ་ཤེས་རབ་ཀྱི་སྣང་བ་ལ་མོས་པའོ།
en: It is wishing to transcend the three existences, wishing to ripen beings, and wishing for the light of higher wisdom.

source: །དེ་ལ་མངོན་པར་ཤེས་པས་རྣམ་པར་འཕྲུལ་པ་གང་ཞེ་ན།
en: “What is the utilization of the higher cognitions?

source: འདི་ལྟ་སྟེ། མངོན་པར་ཤེས་པ་ལྔ་ལ་གནས་ནས་སངས་རྒྱས་ཀྱི་ཆོས་ཤེས་པར་དཀའ་བ་རྣམས་གཞན་ལ་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའོ།
en: It is teaching to others, through the five higher cognitions, the Dharma teachings of the Buddha that are difficult to understand.

source: །དེ་ལ་མིང་གི་བརྡ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of assigned names?

source: ཡོངས་སུ་མ་གྲུབ་པ་རྣམས་མིང་གིས་ཁོང་དུ་ཆུད་པའོ།
en: It is the understanding that names are without reality.

source: །དེ་ལ་བརྟགས་པའི་ཐ་སྙད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the use of designations?

source: འཇིག་རྟེན་གྱི་ཐ་སྙད་དོ།
en: It is worldly usage.

source: །དེ་ལ་བཏགས་པ་འཇོམས་པ་གང་ཞེ་ན།
en: “What is employing designations?

source: འདི་ལྟ་སྟེ། བརྗོད་པར་ཤེས་པའོ།
en: It is the knowledge of speaking.

source: །དེ་ལ་འཁོར་བ་ལས་ལྡོག་པ་གང་ཞེ་ན།
en: “What is disillusionment with saṃsāra?

source: འདི་ལྟ་སྟེ། འཁོར་བའི་ཉེས་པ་ལ་སོ་སོར་རྟོག་པའོ།
en: It is reflecting upon the harm of saṃsāra.

source: །དེ་ལ་རྙེད་པ་མི་འདོད་པ་གང་ཞེ་ན།
en: “What is not being motivated by material gain?

source: འདི་ལྟ་སྟེ། ཡང་དག་པར་འདོད་པ་ཉུང་བའོ།
en: It is having few desires.

source: །དེ་ལ་རྙེད་པ་དང་བཀུར་སྟི་མི་ལེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having no interest in gain or honors?

source: གདུང་བ་མེད་པ་དང་། སྡིག་པ་འདོད་པ་དང་བྲལ་བའོ།
en: It is being free of regret and free of the wish to commit sinful actions.

source: །དེ་ལ་བསྔགས་པ་མ་ཡིན་པས་ཞུམ་པར་མི་འགྱུར་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not being upset by criticism?

source: ཕུང་པོ་དང་། ཁམས་ལ་ཡོངས་སུ་རྟོག་པ་ཤེས་པའོ།
en: It is the knowledge that comprehends the skandhas and the dhātus.

source: །དེ་ལ་ཡང་དག་པར་བསྔགས་པ་མི་ལེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not being fixated upon praise?

source: དགེ་བ་མི་སྤྱོམས་པ་དང་། རྙེད་པ་དང་བཀུར་སྟི་ལ་བར་ཆད་དུ་རིག་པའོ།
en: It is not making known one’s good actions, and it is knowing gain and honor to be obstacles.

source: །དེ་ལ་བཀུར་སྟི་ལ་བཏང་སྙོམས་སུ་བྱེད་པ་གང་ཞེ་ན།
en: “What is indifference to respect?

source: འདི་ལྟ་སྟེ། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་རྟོགས་པའོ།
en: It is understanding the ripening of karma.

source: །དེ་ལ་བསྟི་སྟང་མེད་པ་ལ་ཞུམ་པར་མི་འགྱུར་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not being upset by lack of respect?

source: རྣལ་འབྱོར་མི་གཏོང་བའོ།
en: It is not forsaking the practice.

source: །དེ་ལ་སྨད་པས་མི་འཁྲུགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being undisturbed by disrespect?

source: འཇིག་རྟེན་གྱི་ཆོས་ལ་སོ་སོར་རྟོག་པའོ།
en: It is being aware of worldly qualities.

source: །དེ་ལ་སྟོད་པ་ལ་བཏང་སྙོམས་སུ་བྱེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being indifferent to praise?

source: དགེ་བའི་ཆོས་ཚོལ་ཞིང་འབྱུང་བའོ།
en: It is seeking good actions and abandoning worldly life.

source: །དེ་ལ་རྙེད་པ་མེད་ཀྱང་སེམས་འགོང་བ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not being disheartened when there is no gain?

source: བདག་གིས་བྱས་པའི་ཆོས་རྣམས་ལ་སོ་སོར་རྟོག་པའོ།
en: It is being aware of the qualities that oneself has given rise to.

source: །དེ་ལ་ཁྱིམ་པ་དང་མི་སྟེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not associating with householders?

source: ཟང་ཟིང་ཅི་ཡང་རྣམ་པར་སྤོང་བའོ།
en: It is avoiding any kind of worldly enjoyment.

source: །དེ་ལ་རབ་ཏུ་བྱུང་བ་དང་མི་སྟེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་རིགས་པ་ཡོངས་སུ་སྤོང་བ་དང་། རིགས་པ་ཡོངས་སུ་ཚོལ་བའོ།
en: “What is not associating with renunciants? It is avoiding that which is inappropriate and seeking that which is appropriate.

source: །དེ་ལ་སྤྱོད་ཡུལ་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་གང་ཞེ་ན།
en: “What is avoiding that which is outside the scope of correct conduct?

source: འདི་ལྟ་སྟེ། སྒྲིབ་པ་ལྔ་རྣམ་པར་སྤོང་བའོ།
en: It is abandoning the five obscurations.

source: །དེ་ལ་སྤྱོད་ཡུལ་ལ་རབ་ཏུ་སྤྱོད་པ་གང་ཞེ་ན།
en: “What is acting within the scope of correct conduct?

source: འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་སྒོམ་པའོ།
en: It is meditation on the four mindfulnesses.

source: །དེ་ལ་ཆོ་ག་ཕུན་སུམ་ཚོགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the perfection of conduct?

source: ཕ་རོལ་རྗེས་སུ་སྲུང་བའོ།
en: It is its perfect preservation.

source: །དེ་ལ་ཆོ་ག་མ་ཡིན་པ་རྣམ་པར་སྤོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is rejecting incorrect conduct?

source: བདག་གི་དགེ་བའི་ཆོས་རྗེས་སུ་སྲུང་བའོ།
en: It is preserving your good qualities.

source: །དེ་ལ་རིགས་སུན་པར་མི་བྱེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not dishonoring your family?

source: ཤེས་ཀྱི་ཁེ་རྣམ་པར་སྤང་བའོ།
en: It is avoiding profiting from wisdom.

source: །དེ་ལ་བསྟན་པ་སྲུང་བ་གང་ཞེ་ན།
en: “What is preserving the teaching?

source: འདི་ལྟ་སྟེ། ཆོས་ཡོངས་སུ་བཙལ་བ་སྒྲུབ་པ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་ནན་ཏན་ནོ།
en: It is the determined seeking of the Dharma and practicing the Dharma in accord with the Dharma.

source: །དེ་ལ་སྨྲ་བ་ཉུང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is speaking little?

source: ཞི་གནས་ཐོབ་པའོ།
en: It is the attainment of śamatha.

source: །དེ་ལ་མཉེན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is speaking softly?

source: ལྷག་མཐོང་ཐོབ་པའོ།
en: It is the attainment of vipaśyanā.

source: །དེ་ལ་ཚིག་གི་ལན་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is skillfulness in answers?

source: ལན་དང་། ཡང་ལན་ཤེས་པའོ།
en: It is the knowledge of replies and rejoinders.

source: །དེ་ལ་ཕས་ཀྱི་རྒོལ་བ་ཚར་གཅོད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is defeating opposition?

source: ཆོས་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པ་དང་། རྣམ་པར་གཞག་པར་བྱེད་པ་དང་། ཀླན་ཀ་ཚོལ་བ་ཚར་གཅོད་པའོ།
en: It is the correct presentation and teaching of the Dharma and defeating those who believe in objective reality.

source: །དེ་ལ་དུས་སུ་འགྲོ་བ་གང་ཞེ་ན།
en: “What is arriving at the right time?

source: འདི་ལྟ་སྟེ། དུས་ཤེས་པའོ།
en: It is knowledge of the time.

source: །དེ་ལ་སོ་སོའི་སྐྱེ་བོ་ལ་ཡིད་མི་རྟོན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྱིས་པའི་ཆོས་ལ་སྐྱོན་དུ་ལྟ་བའོ།
en: “What is not relying on ordinary people? It is seeing the qualities of the foolish to be faults.

source: །དེ་ལ་སྡུག་བསྔལ་བ་རྣམས་ལ་བརྙས་པ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་མཉམ་པའོ།
en: “What is not having contempt for those in suffering? It is having impartiality toward all beings.

source: །དེ་ལ་སྡུག་བསྔལ་བ་རྣམས་ལ་ནོར་རབ་ཏུ་སྦྱིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འཇིག་རྟེན་གྱི་ཟང་ཟིང་གི་སྦྱིན་པའོ།
en: “What is giving wealth to those who are in suffering? It is giving them worldly goods.

source: །དེ་ལ་དབུལ་པོ་རྣམས་ལ་མི་སྨོད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is not rebuking the poor?

source: ཕ་རོལ་ལ་སྙིང་བརྩེ་བའི་བློའོ།
en: It is having kindness toward others.

source: །དེ་ལ་ཚུལ་ཁྲིམས་འཆལ་པ་རྣམས་ལ་སྙིང་བརྩེ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having compassion for those whose conduct is incorrect?

source: ཕ་རོལ་ལྟུང་བ་ལས་བྱུང་ཞིང་ཚུལ་ཁྲིམས་ལ་རབ་ཏུ་འགོད་པའོ།
en: It is saving others from transgression and establishing them in correct conduct.

source: །དེ་ལ་ཕན་པའི་དངོས་པོ་གང་ཞེ་ན།
en: “What is having that which will bring benefit to others?

source: འདི་ལྟ་སྟེ། གཞན་ལ་ཕན་པར་བྱེད་པའོ།
en: It is benefiting others.

source: །དེ་ལ་སྙིང་རྗེ་བའི་བློ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having a compassionate mind?

source: སེམས་ཅན་གྱི་མ་འོངས་པའི་སྡུག་བསྔལ་ལ་ལྟ་བའོ།
en: It is consideration of the future suffering of beings.

source: །དེ་ལ་ཆོས་ཀྱིས་ཕན་གདགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is benefiting others through the Dharma?

source: གཞན་དག་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ལ་གཟུད་པའོ།
en: It is bringing others correctly into the Dharma.

source: །དེ་ལ་ཟང་ཟིང་ཡོངས་སུ་གཏོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is giving away material wealth?

source: ཕུང་པོ་ཡོངས་སུ་གཏོང་བ་དང་། གཞན་ལ་ཟང་ཟིང་གིས་ཕན་འདོགས་པའོ།
en: It is giving away whatever has been accumulated and benefiting others through material things.

source: །དེ་ལ་སོགས་པའི་གནས་མེད་པ་གང་ཞེ་ན།
en: “What is not hoarding?

source: འདི་ལྟ་སྟེ། ཟང་ཟིང་ལ་སྨོད་པ་དང་། སྲུང་བའི་ཉེས་པ་མཐོང་བའོ།
en: It is renouncing material wealth and seeing it as harmful to the maintenance of correct conduct.

source: །དེ་ལ་ཚུལ་ཁྲིམས་བསྔགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is praising correct conduct?

source: ཚུལ་ཁྲིམས་ཡོངས་སུ་རིག་པའོ།
en: It is the knowledge of the result of correct conduct.

source: །དེ་ལ་འཆལ་པའི་ཚུལ་ཁྲིམས་ལ་སྨད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is condemning incorrect conduct?

source: འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཉེས་པ་ཁོང་དུ་ཆུད་པའོ།
en: It is the understanding of the faults of incorrect conduct.

source: །དེ་ལ་ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ་དག་ལ་གཡོ་མེད་པར་སྟེན་པ་གང་ཞེ་ན།
en: “What is unwaveringly attending upon those who have correct conduct?

source: འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་དང་ལྡན་པ་ལ་རྙེད་པར་དཀའ་བའི་འདུ་ཤེས་སུ་ཤེས་པའོ།
en: It is the knowledge that perceives those who have correct conduct to be difficult to find.

source: །དེ་ལ་ཡོད་པ་ཐམས་ཅད་གཏོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is giving up all possessions?

source: བསམ་པ་དགེ་བའོ།
en: It is having a virtuous motivation.

source: །དེ་ལ་ལྷག་པའི་བསམ་པས་མགྲོན་དུ་གཉེར་བ་གང་ཞེ་ན།
en: “What is welcoming others with a higher motivation?

source: འདི་ལྟ་སྟེ། ཕ་རོལ་ལ་བདེ་བ་འདོད་པའོ།
en: It is wishing to benefit others.

source: །དེ་ལ་སྨྲས་པ་བཞིན་བྱེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is doing exactly what one has said one will do?

source: བསམ་པ་དགེ་བ་ཕུན་སུམ་ཚོགས་པའོ།
en: It is having a completely virtuous motivation.

source: །དེ་ལ་རྒྱུན་མི་ཆད་པར་བསྙེན་བཀུར་བྱེད་པ་གང་ཞེ་ན།
en: “What is perpetual application?

source: འདི་ལྟ་སྟེ། དགེ་བ་གང་ཡིན་ཞེས་ཚོལ་ཞིང་འདྲི་བའོ།
en: It is seeking for and inquiring about any virtue.

source: །དེ་ལ་དགའ་བ་མྱོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is having veneration and experiencing joy?

source: ཁོང་དུ་ཆུད་པའི་ཤེས་པ་དང་ལུང་གི་ཤེས་པའོ།
en: It is knowledge through realization and knowledge through scripture.

source: །དེ་ལ་དཔེ་ཤེས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the knowledge of using examples?

source: འདྲ་བ་ཤེས་པ་དང་། གདམས་པ་ཤེས་པའོ།
en: It is having the knowledge of similarities and the knowledge of teaching.

source: །དེ་ལ་སྔོན་བྱུང་བ་ལ་མཁས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is being skilled concerning past lifetimes?

source: སྐྱེ་བ་དྲན་པ་དང་། ཐོས་པ་མང་བའོ།
en: It is remembering lifetimes and having received many teachings.

source: །དེ་ལ་དགེ་བའི་རྩ་བ་སྔོན་དུ་འགྲོ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is putting roots of merit first?

source: བྱང་ཆུབ་ལ་ཤིན་ཏུ་འདུན་པ་དང་། གཞན་དག་ཀྱང་སྤྲོ་བར་བྱེད་པའོ།
en: It is having a strong longing for enlightenment and also inspring that in others.

source: །དེ་ལ་ཐབས་མཁས་པ་གང་ཞེ་ན།
en: “What is skill in methods?

source: འདི་ལྟ་སྟེ། སོ་སོར་འཆགས་པ་དང་། རྗེས་སུ་ཡི་རང་བ་དང་། གསོལ་བ་འདེབས་པ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་བསྔོ་བ་ལ་མཁས་པའོ།
en: It is being skilled in confession, rejoicing, supplication, and the dedication of the roots of goodness.

source: །དེ་ལ་མཚན་མ་སྤོང་བ་གང་ཞེ་ན།
en: “What is the negation of attributes?

source: འདི་ལྟ་སྟེ། ཆོས་རྣམས་རྨི་ལམ་ལྟ་བུར་རྟོགས་ནས་དངོས་པོ་རྣམ་པར་འཇིག་པའོ།
en: It is realizing that all phenomena are like a dream, and the extinction of things.

source: །དེ་ལ་འདུ་ཤེས་ཟློག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕྱིན་ཅི་ལོག་འདོར་བའོ།
en: “What is turning away from conceptualization? It is the rejection of error.

source: །དེ་ལ་དངོས་པོའི་མཚན་ཉིད་འདོར་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མཚན་ཉིད་མེད་པར་ཤེས་པའོ།
en: “What is the knowledge of the characteristics of things? It is the knowledge of things having no characteristics.

source: །དེ་ལ་མདོ་སྡེ་མངོན་པར་སྒྲུབ་པ་ལ་མཁས་པ་གང་ཞེ་ན།
en: “What is skill in the accomplishment of the sūtras?

source: འདི་ལྟ་སྟེ། དགེ་བ་དང་མི་དགེ་བའི་ཆོས་ཡང་དག་པ་ཇི་ལྟ་བ་རྣམས་དཔེ་དང་རྟོགས་པ་བརྗོད་པས་ཡང་དག་པར་རབ་ཏུ་སྟོན་པའོ།
en: It is teaching through describing accurately the understanding of, and the examples for, good and bad qualities.

source: །དེ་ལ་བདེན་པ་རྣམ་པར་གཏན་ལ་དབབ་པ་གང་ཞེ་ན།
en: “What is certainty in the truth?

source: འདི་ལྟ་སྟེ། རྣམ་པར་ཤེས་པ་འགོག་པ་དང་། མིང་དང་གཟུགས་མི་སྐྱེ་བའོ།
en: It is the cessation of consciousness, and the nonarising of names-and-form.

source: །དེ་ལ་རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་བྱེད་པ་གང་ཞེ་ན།
en: “What is the direct experience of liberation?

source: འདི་ལྟ་སྟེ། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལས་མི་གཡོ་བ་དང་། མི་འཁྲུག་པའོ།
en: It is not wavering from the samādhi that is like a vajra.

source: །དེ་ལ་གཅིག་ཏུ་བརྗོད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the single teaching?

source: མུ་སྟེགས་ཅན་གྱི་གནས་སྨད་པ་དང་། མི་སྐྱེ་བར་ཤེས་པའོ།
en: It is not being reborn in the inferior state of a tīrthika.

source: །དེ་ལ་མི་འཇིགས་པ་ཐོབ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the attainment of fearlessness?

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་རྟོགས་ཤིང་སྟོབས་བསྐྱེད་པའོ།
en: It is understanding the Buddha’s Dharma and developing the strength of dhyāna.

source: །དེ་ལ་ཚུལ་ཁྲིམས་ཀྱི་གནས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the basis of correct conduct?

source: ལུས་ཀྱི་སྡོམ་པ་དང་སོ་སོར་ཐར་པའི་སྡོམ་པའོ།
en: It is the restraint of the body and the prātimokṣa vows.

source: །དེ་ལ་སྙོམས་པར་འཇུག་པ་ལ་འཇུག་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is entering into samāpatti?

source: ཁམས་གསུམ་ལ་འདོད་ཆགས་དང་བྲལ་བའོ།
en: It is being free of desire for the three existences.

source: །དེ་ལ་ཤེས་རབ་ཐོབ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the attainment of wisdom?

source: ནུས་པ་ཤེས་པ་དང་། མི་དམིགས་པའོ།
en: It is the knowledge of power and having no objectification.

source: །དེ་ལ་གཅིག་པུར་དགའ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is delighting in solitude?

source: འདུ་འཛིའི་ཉེས་པ་རྣམ་པར་སྤོང་བ་དང་། ཆོས་དཀར་པོ་མི་གཏོང་བའོ།
en: It is avoiding the faults from being with others and not forsaking good qualities.

source: །དེ་ལ་ཤེས་ཀྱི་ཁེ་ཆུང་ངུས་ཆོག་ཤེས་པ་གང་ཞེ་ན།
en: “What is contentment with having no high reputation? It is being pleased with whatever there is.

source: འདི་ལྟ་སྟེ། ངན་ངོན་གྱིས་མགུ་བའོ། །དེ་ལ་སེམས་ལ་རྙོག་པ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the absence of pollution in the mind?

source: སྒྲིབ་པ་རྣམས་རྣམ་པར་གནོན་པའོ།
en: It is the suppression of the obscurations.

source: །དེ་ལ་བལྟ་བར་བྱས་པ་རྣམ་པར་སྤོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is rejecting incorrect views?

source: དམིགས་པའི་ལྟ་བ་རྣམ་པར་སྤོང་བའོ།
en: It is rejecting the view of objective reality.

source: །དེ་ལ་གཟུངས་ཐོབ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the attainment of mental retention?

source: ཆོས་ཇི་ལྟར་མཐོང་བ་རྣམས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆགས་པ་མེད་པར་རབ་ཏུ་སྟོན་པའོ།
en: It is teaching correctly and without impediment the Dharma just as it has been seen.

source: །དེ་ལ་ཡེ་ཤེས་སྣང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རང་བཞིན་ལ་འཇུག་པའོ།
en: “What is the entrance into knowledge? It is the entrance into the true nature.

source: །དེ་ལ་གནས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the basis?

source: ཚུལ་ཁྲིམས་ཀྱི་གནས་སོ།
en: It is the basis of correct conduct.

source: །དེ་ལ་གཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the ground?

source: སེམས་ཀྱི་གཞིའོ།
en: It is the ground of the mind.

source: །དེ་ལ་རྟེན་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the foundation?

source: དད་པ་ལ་རྟེན་པའོ།
en: It is the foundation of faith.

source: །དེ་ལ་ནན་ཏན་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the practice?

source: ལམ་གྱི་ནན་ཏན་ནོ།
en: It is the practice of the path.

source: །དེ་ལ་རྒྱུ་གང་ཞེ་ན།
en: “What is the knowledge of the cause?

source: འདི་ལྟ་སྟེ། མ་རིག་པ་འཁོར་བའི་རྒྱུའོ།
en: It is the knowledge that ignorance is the cause of saṃsāra.

source: །དེ་ལ་རིགས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the method?

source: རིགས་པ་ནི་ཐར་པའི་རིགས་པའོ།
en: It is knowledge as the method of liberation.

source: །དེ་ལ་ཚུལ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the way?

source: སྲེད་པ་རབ་ཏུ་སྤངས་པའོ།
en: It is the way of the rejection of craving.

source: །དེ་ལ་སྒོ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the doorway?

source: ཉེས་པ་སྤངས་པའོ།
en: It is abandoning faults.

source: །དེ་ལ་ལམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the path?

source: མི་རྟག་པ་དང་། སྡུག་བསྔལ་བ་དང་། སྟོང་པ་དང་། བདག་མེད་པར་ཤེས་པའོ།
en: It is the knowledge of impermanence, suffering, emptiness, and selflessness.

source: །དེ་ལ་ས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྨོན་པ་མེད་པའི་ས་བཅུའོ།
en: “What is the level? It is the tenfold level of the absence of aspiration.

source: །དེ་ལ་སྐྱེ་བ་དང་བྲལ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སྐྱེ་བ་བཅད་པའོ།
en: “What is being free from rebirth? It is putting an end to rebirth.

source: །དེ་ལ་ཡེ་ཤེས་ཀྱི་ས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the level of knowledge?

source: རྨོངས་པ་མེད་པའོ།
en: It is being free of stupidity.

source: །དེ་ལ་མི་ཤེས་པ་སྤངས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the elimination of ignorance?

source: གཏི་མུག་སྤངས་པའོ།
en: It is the elimination of stupidity.

source: །དེ་ལ་ཡེ་ཤེས་གནས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the basis of wisdom?

source: མི་གནས་པའོ།
en: It is without a basis.

source: །དེ་ལ་རྣལ་འབྱོར་སྤྱོད་པའི་ས་གང་ཞེ་ན།
en: “What is the level of spiritual practice?

source: འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ཆོས་རྣམས་སྒོམ་པའོ།
en: It is meditation on the qualities of the thirty-seven aspects of enlightenment.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the scope of practice of the bodhisattvas?

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ།
en: It is composed of the six perfections.

source: །དེ་ལ་སྐྱེས་བུ་དམ་པ་སྟེན་པ་གང་ཞེ་ན།
en: “What is attending upon wise beings?

source: འདི་ལྟ་སྟེ། སངས་རྒྱས་ལ་སྟེན་པའོ།
en: It is attending upon buddhas.

source: །དེ་ལ་སྐྱེས་བུ་དམ་པ་མ་ཡིན་པ་སྤངས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is rejecting those who are not wise beings?

source: མུ་སྟེགས་ཅན་དམིགས་པར་ལྟ་བ་རྣམས་རྣམ་པར་སྤོང་བའོ།
en: It is rejecting tīrthikas who have the view of objective reality.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the teaching of the tathāgatas?

source: སངས་རྒྱས་ཀྱི་སྟོབས་ལ་གནས་པ་ནས་རང་བཞིན་ཤེས་པས་ཐར་པའོ།
en: It is liberation through knowledge of the true nature, having gained the strengths of buddhahood.

source: །དེ་ལ་སངས་རྒྱས་ཀྱི་ས་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is the level of buddhahood?

source: དགེ་བའི་ཆོས་ཐམས་ཅད་ཐོབ་པའོ།
en: It is the attainment of all good qualities.

source: །དེ་ལ་མཁས་པས་རྗེས་སུ་ཡི་རང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is meant by the wise rejoicing in it?

source: འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་ཉན་ཐོས་དག་གིས་རྗེས་སུ་ཡི་རང་བའོ།
en: It means the buddha bhagavāns, and the śrāvakas of the past, future, and present, rejoicing.

source: །དེ་ལ་བྱིས་པ་དག་གིས་སྤངས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is meant by the foolish rejecting it?

source: བྱིས་པ་ཐམས་ཅད་ཀྱིས་རིག་པར་དཀའ་བའོ།
en: It means that it is difficult for all who are foolish to understand.

source: །དེ་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱིས་ཤེས་པར་དཀའ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is meant by it being difficult for the śrāvakas and pratyekabuddhas to know?

source: སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: It means that the Buddha’s Dharma is inconceivable.

source: །དེ་ལ་མུ་སྟེགས་ཅན་གྱིས་མ་ཡིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is meant by it not being the level of the tīrthikas?

source: རྣལ་འབྱོར་པ་དག་གི་ལོག་པའི་ང་རྒྱལ་ལོ།
en: It means that their level is the false pride of a practitioner.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་ཡོངས་སུ་གཟུང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is meant by the bodhisattvas possessing it?

source: རྙེད་པར་དཀའ་བ་དང་རྩི་ཆེན་པོར་གྱུར་པའོ།
en: It means that it is difficult to obtain and is a great medicine.

source: །དེ་ལ་སྟོབས་བཅུ་དག་གིས་ཁོང་དུ་ཆུད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What is meant by its being realized by those who have the ten strengths?

source: དཀའ་བའི་ཚུལ་གྱིས་སོ།
en: It means that it is an arduous practice.

source: །དེ་ལ་ལྷ་རྣམས་ཀྱིས་མཆོད་པར་བྱ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why should the devas make offerings to it?

source: བདེ་བ་ཐམས་ཅད་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: They should do so in order to attain every happiness.

source: །དེ་ལ་ཚངས་པ་དག་གིས་ཕྱག་བྱ་བ་གང་ཞེ་ན།
en: “Why should Brahmā praise it?

source: འདི་ལྟ་སྟེ། ཐར་པ་ཐམས་ཅད་ཐོབ་པར་བྱེད་པའི་ཚུལ་གྱིས་སོ།
en: Because it is a practice that brings the attainment of all liberations.

source: །དེ་ལ་ཀླུ་རྣམས་ཀྱིས་ཕྱག་བྱ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Why should the nāgas pay homage to it?

source: བག་ཆགས་ཐམས་ཅད་གཅོད་པའི་ཕྱིར་རོ།
en: Because it destroys all habitual tendencies.

source: །དེ་ལ་གནོད་སྦྱིན་དག་གིས་རྗེས་སུ་ཡི་རང་བར་བྱ་བ་གང་ཞེ་ན།
en: “Why should the yakṣas rejoice in it?

source: འདི་ལྟ་སྟེ། ངན་འགྲོ་ཐམས་ཅད་ཀྱི་ལམ་གཅོད་པའི་ཕྱིར་རོ།
en: Because it closes the pathways to all the lower realms.

source: །དེ་ལ་མིའམ་ཅི་དག་གིས་ཕྱག་བྱ་བ་གང་ཞེ་ན།
en: “Why should the kinnaras praise it in song?

source: འདི་ལྟ་སྟེ། ཐར་པའི་རབ་ཏུ་བདེ་བ་ཐམས་ཅད་ཐོབ་པར་བྱ་བའི་ཕྱིར་རོ།
en: Because it brings the attainment of all the happiness of liberation.

source: །དེ་ལ་ལྟོ་འཕྱེ་ཆེན་པོ་དག་གིས་རབ་ཏུ་བསྔགས་པ་གང་ཞེ་ན།
en: “Why should the mahoragas laud it?

source: འདི་ལྟ་སྟེ། འཁོར་བ་གཅོད་པའི་ཕྱིར་རོ།
en: Because it destroys saṃsāra.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་དག་གིས་བསྒོམ་པར་བྱ་བ་གང་ཞེ་ན།
en: “Why should the bodhisattvas meditate on it?

source: འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of omniscient wisdom.

source: །དེ་ལ་མཁས་པ་དག་གིས་ཀུན་ཆུབ་པར་བྱ་བ་གང་ཞེ་ན།
en: “Why should the wise comprehend it?

source: འདི་ལྟ་སྟེ། ཕྱིར་མི་ལྡོག་པའི་ས་ཐོབ་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it brings the attainment of irreversibility.
